Revit 2027 API
BuiltInFailures.InaccurateFailures.InaccurateLine Property
 Line is slightly off axis and may cause inaccuracies.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InaccurateLine { get; }
Public Shared ReadOnly Property InaccurateLine As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InaccurateLine {
	FailureDefinitionId^ get ();
}
static member InaccurateLine : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.InaccurateFailures Class
Autodesk.Revit.DB Namespace